---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCurtainGrid
source: html/d06bf65e-f072-7ac2-32b6-a25897616937.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCurtainGrid Property

Can't create Curtain Wall Grid Line.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCurtainGrid { get; }
```